# можно юзать библиотекe re
# задача 1. Создайте программу для игры с конфетами человек против человека.
# Условие задачи: На столе лежит 2021 конфета. Играют два игрока делая ход друг после друга.
# Первый ход определяется жеребьёвкой. За один ход можно забрать не более чем 28 конфет.
# Все конфеты оппонента достаются сделавшему последний ход.
# Сколько конфет нужно взять первому игроку, чтобы забрать все конфеты у своего конкурента?
# Делаем игру против бота
# а) Подумайте как наделить бота ""интеллектом""

try:
    Sweets = int(input('Введите количество конфет на столе '))
    x = int(input('Сколько конфет можно брать за ход? '))
    A = Sweets % (x+1)

    if A < 1:
        A = 1
    print(f'Бот забрал {A} конфет!')
    Sweets -= A

    while Sweets > 0:
        B = int(input(f'Игрок 2, сколько конфет желаете забрать из {Sweets}? '))
        while B > x or B < 1:
            B = int(input(f'Введите количество от 0 до {x}!'))
        else:
            Sweets -= B
        if Sweets <= 0:
            print('Игрок 2 - победитель!')
            break
        A = x + 1 - B
        print(f'Бот взял {A} конфет')
        Sweets -= A
        if Sweets <= 0:
            print('Бот - победитель!')
            break

except:
    print('Вводите корректные значения!')